Public Attributes | List of all members
API_CWPanelQuantity Struct Reference
Element Manager
Describes the different calculated values for curtain wall panels. More...
#include <APIdefs_Elements.h>
 Public Attributes
 GS::uchar_t  | typeText [API_UniLongNameLen]
Name of the GDL object.
 double  | vertDirection
Vertical direction.
 double  | horDirection
Horizontal direction.
 double  | thickness
Thickness of the panel.
 double  | surface
Net surface of the panel. Equal to grossSurface minus the surface covered by neighbouring frames.
 double  | grossSurface
Gross Surface of the panel. Equal to surface plus the surface covered by neighbouring frames.
 double  | perimeter
Net perimeter of the frame.
 double  | grossPerimeter
Gross perimeter of the frame.
 API_AttributeIndex  | material_outer
Material index of the exterior surface of the panel.
 API_AttributeIndex  | material_inner
Material index of the edge of the panel.
 API_AttributeIndex  | material_cut
Material index of the interior surface of the panel.
 short  | function
Type of the panel. Possible values: 0 - fixed, 1 - door, 2 - window (value of AC_Panel_Type GDL parameter)
 double  | width
Width of the panel. (The visible part of the panel. It doesn't includes the part covered by neighbouring frames.)
 double  | nominalWidth
Nominal panel width (it is equal to width if the panel is generic [non GDL based].)
 double  | height
Reserved for later use. (The visible part of the panel. It doesn't includes the part covered by neighbouring frames.)
 double  | nominalHeight
Nominal panel height (it is equal to height if the panel is generic [non GDL based].)
 GS::uchar_t  | orientationText [API_UniLongNameLen]
Orientation text in Unicode.
 double  | filler [4]
Reserved for later use.
Detailed Description
Describes the different calculated values for curtain wall panels.
Remarks
See also the curtain wall panel parameters for listing in Appendix A of the GDL Reference manual.